[
    {
        "id": 0,
        "name": "Travel Agency",
        "image": "/images/02-portfolio-1.jpg",
        "gitURL": "https://enwokedi96.github.io/activity-travelCalifornia/",
        "gitRepo": "https://github.com/enwokedi96/activity-travelCalifornia/",
        "type": "personal challenge",
        "description": "This is a basic travel website using HTML, CSS and Bootstrap - applying these to code from scratch"
    },
    {
        "id": 1,
        "name": "First Portfolio",
        "image": "/images/02-portfolio-2.jpg",
        "gitURL": "https://enwokedi96.github.io/enwokedi-s_portfolio/",
        "gitRepo": "https://github.com/enwokedi96/enwokedi-s_portfolio/",
        "type": "personal challenge",
        "description": "This repo contains my portfolio which details my educational background and experience. It contains the following sections: about me, coding projects(specifically frontend projects), curriculim vitae and various contact channels. And while the current overview look sparse, more exciting projects and deployments will be added in the nearest future."
    },
    {
        "id": 2,
        "name": "Second Portfolio",
        "image": "/images/02-portfolio-3.jpg",
        "gitURL": "https://enwokedi96.github.io/Bootstrap-Portfolio/",
        "gitRepo": "https://github.com/enwokedi96/Bootstrap-Portfolio/",
        "type": "personal challenge",
        "description": "This repo contains my portfolio which details my educational background and experience. It is a redo of my previous portfolio utilizing bootstrap 4.3 in place of custom css. It contains the following sections (in order): coding projects(specifically frontend projects), skills (soft and hard), Resume, About me and various contact channels."
    },
    {
        "id": 3,
        "name": "Hodophile",
        "image": "/images/02-portfolio-4.jpg",
        "gitURL": "https://enwokedi96.github.io/hodophile/",
        "gitRepo": "https://github.com/enwokedi96/hodophile/",
        "type": "group project",
        "description":"This is a user-friendly website that allows users to search known holiday destinations and access information on hotels in the area as well as weather conditions in the holiday destination. This is the height of life!!! Enjoy Every moment!! Feel the Joy!! ❤️❤️"
    },
    {
        "id": 4,
        "name": "Horiseon: Basic Refactoring",
        "image": "/images/02-run-buddy.jpg",
        "gitURL": "https://enwokedi96.github.io/horiseon_services/",
        "gitRepo": "https://github.com/enwokedi96/horiseon_services/",
        "type": "personal challenge",
        "description": "The motivation behind building and deploying this webpage is to refactor code including html, css and markdown best practices. This excercise also pushes the boundaries of classroom curriculum and ignites a better understanding of these programming languages. The refactoring included shortening style classes for brevity, changing most div (at top and sub levels) to sections, and repairing link from top tab to relevant in-page section. A new functionality has also been added to aid users easily return to top of page."
    }
]